In [2]:
try:
    %tensorflow_version 2.x
    COLAB = True
    print("Note: using Google CoLab try")
except:
    print("Note: not using Google CoLab")
    COLAB = False

Note: using Google CoLab try

In [3]:
import os
import pandas as pd
import numpy as np

In [4]:
df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/auto-mpg.csv", 
    na_values=['NA', '?'])

In [6]:
df.head(5)

    mpg  cylinders  displacement  ...  year  origin                       name
0  18.0          8         307.0  ...    70       1  chevrolet chevelle malibu
1  15.0          8         350.0  ...    70       1          buick skylark 320
2  18.0          8         318.0  ...    70       1         plymouth satellite
3  16.0          8         304.0  ...    70       1              amc rebel sst
4  17.0          8         302.0  ...    70       1                ford torino

[5 rows x 9 columns]

In [7]:
print(df.index)

RangeIndex(start=0, stop=398, step=1)

## SHUFFLE

In [10]:
np.random.permutation(df.index)

array([292, 308,  79, 188,  77, 211, 101, 239,  78, 194, 344,  54, 335,
       353, 366, 392, 252, 210, 215, 249, 111, 222, 157, 179, 332, 221,
       191, 290, 106, 381,  66, 212, 307, 205, 264, 166, 121, 329,  40,
        44,  61, 356,  97, 141, 296, 149, 266, 310, 176, 313, 246,  84,
        35,  68, 100, 282, 339, 248, 275, 133, 197, 201,  23, 214,  49,
       162, 230, 372, 107, 272, 132, 274, 345, 140, 184,  50, 190,   1,
       102, 227,  11, 145, 306, 333, 304, 168,  57,  55, 220, 276, 369,
        39, 206,   0, 350, 245, 295, 265,  98, 131, 204, 314,  90, 242,
       114,  96, 238, 358, 237, 319, 125,  45,  53,   2, 311, 139, 113,
       375,  25, 255, 378,  32, 261, 154, 298, 362, 327, 228, 251,  51,
       123, 216, 312, 281, 383, 338, 287, 363,  62, 223, 293,  19, 219,
       254, 360, 158, 301, 326,  65,  75, 240, 234,  34, 172, 183, 117,
       303, 137,  91,  36,  48,  21, 361,  67, 118, 164, 177, 330, 297,
       225,  82, 382, 374, 286,  37,  56,  76, 250,  41, 231, 247, 159,
        47, 144, 370, 258,  89, 395, 200, 198, 116, 175,  22, 348,  10,
        92,  52, 104, 365, 285,  99,  59,   4, 278, 364,  38, 346, 386,
        58, 337, 388, 341, 226, 203, 244, 280, 268, 170, 120,  12,  94,
       387, 109, 130, 213, 267, 340, 263,  64,   5, 124, 336, 186, 155,
       325, 151,  69,  33, 270, 236,  13, 181,   3, 103, 342, 277,  87,
         8,  42,  31, 129, 161, 300, 148, 320,  43, 192,  24, 178, 321,
       351, 322,  72,  26, 112, 174, 195,  74, 396, 391,  73, 373, 269,
       377,  17, 376, 380,  86, 305, 379, 359,  71,   6, 257,  81, 273,
       138, 291, 180, 196, 318, 224, 136, 153, 232, 390, 128, 355, 135,
       193, 235, 165,   9, 208, 349, 315, 202, 397, 173, 347, 243,  85,
       279, 134, 302, 217, 185, 371, 156,  88, 357, 260, 343,  15, 187,
       331, 108, 233, 394,  80,  29, 316, 207, 299,  93, 169, 309, 367,
       147, 122,  20,  30,  63, 393, 115, 171, 241, 152, 384, 289, 259,
       389, 163, 294, 199, 354, 288,  46, 334, 328, 317, 253, 126, 324,
        27, 385, 105, 143, 142,  14, 167,  70,  16,  18, 284, 229, 352,
        95, 271, 146, 160, 209,   7, 283, 218, 256,  60,  28, 368, 323,
        83, 189, 119, 150, 110, 182, 127, 262])

In [11]:
df = df.reindex(np.random.permutation(df.index))

In [12]:
df.index

Int64Index([189, 350, 207, 197, 295, 259, 246, 360, 133, 290,
            ...
            375, 141, 172,  46, 171, 349, 347, 230,  58,  91],
           dtype='int64', length=398)

In [13]:
df.head(5)

      mpg  cylinders  displacement  ...  year  origin                         name
189  15.5          8         304.0  ...    76       1                  amc matador
350  34.7          4         105.0  ...    81       1           plymouth horizon 4
207  20.0          4         130.0  ...    76       2                    volvo 245
197  29.0          4          90.0  ...    76       2                    vw rabbit
295  35.7          4          98.0  ...    79       1  dodge colt hatchback custom

[5 rows x 9 columns]

In [14]:
pd.set_option('display.max_columns', 7)
pd.set_option('display.max_rows', 5)

df.reset_index(inplace=True, drop=True)
display(df)

,mpg,cylinders,displacement,...,year,origin,name
0,15.5,8,304.0,...,76,1,amc matador
1,34.7,4,105.0,...,81,1,plymouth horizon 4
...,...,...,...,...,...,...,...
396,25.0,4,97.5,...,72,1,dodge colt hardtop
397,13.0,8,400.0,...,73,1,chevrolet caprice classic

# Sorting  but generally shuffle in preprocessing

In [16]:
import os
import pandas as pd

df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/auto-mpg.csv", 
    na_values=['NA', '?'])

df = df.sort_values(by='name', ascending=True)
print(f"The first car is: {df['name'].iloc[0]}")
      
pd.set_option('display.max_columns', 7)
pd.set_option('display.max_rows', 5)
display(df)

The first car is: amc ambassador brougham

      mpg  cylinders  displacement  ...  year  origin                     name
96   13.0          8         360.0  ...    73       1  amc ambassador brougham
9    15.0          8         390.0  ...    70       1       amc ambassador dpl
..    ...        ...           ...  ...   ...     ...                      ...
325  44.3          4          90.0  ...    80       2     vw rabbit c (diesel)
293  31.9          4          89.0  ...    79       2         vw rabbit custom

[398 rows x 9 columns]

### Grouping a Data Set

Grouping is a typical operation on data sets.  Structured Query Language (SQL) calls this operation a "GROUP BY."  Programmers use grouping to summarize data.  Because of this, the summarization row count will usually shrink, and you cannot undo the grouping.  Because of this loss of information, it is essential to keep your original data before the grouping. 

The Auto MPG dataset is used to demonstrate grouping.

In [17]:
import os
import pandas as pd

df = pd.read_csv(
    "https://data.heatonresearch.com/data/t81-558/auto-mpg.csv", 
    na_values=['NA', '?'])

pd.set_option('display.max_columns', 7)
pd.set_option('display.max_rows', 5)
display(df)

,mpg,cylinders,displacement,...,year,origin,name
0,18.0,8,307.0,...,70,1,chevrolet chevelle malibu
1,15.0,8,350.0,...,70,1,buick skylark 320
...,...,...,...,...,...,...,...
396,28.0,4,120.0,...,82,1,ford ranger
397,31.0,4,119.0,...,82,1,chevy s-10

In [19]:
g = df.groupby('cylinders')['mpg'].mean()
g.head(5)

cylinders
3    20.550000
4    29.286765
5    27.366667
6    19.985714
8    14.963107
Name: mpg, dtype: float64

In [20]:
d = g.to_dict()
d

{3: 20.55,
 4: 29.28676470588236,
 5: 27.366666666666664,
 6: 19.985714285714284,
 8: 14.963106796116508}

In [23]:
df.groupby('cylinders')['mpg'].count().to_dict()

{3: 4, 4: 204, 5: 3, 6: 84, 8: 103}